/*
Выполнить задание двумя способами: с использованием оператора if и с ис-
пользованием условного оператора ?. Выполнить задания, минимизируя количе-
ство выполняемых операций сравнения и присваивания.
*/
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");

	cout << "Пастушенко Антон, 7 группа, 1 курс. Решение задания 3, Б-часть, 3 вариант \n" << endl;

	double x1, x2, x3, x4, c;
	double x12, x22, x32, x42;

	cout << "Введите число х1: " << endl;
	cin >> x1; x12 = x1;

	cout << "Введите число х2: " << endl;
	cin >> x2; x22 = x2;

	cout << "Введите число х3: " << endl;
	cin >> x3; x32 = x3;

	cout << "Введите число х4: " << endl;
	cin >> x4; x42 = x4;

	cout << "\nРаботает первый способ!" << endl;

	if (x1 > x2)
	{
		c = x1;
		x1 = x2;
		x2 = c;
	}
	if (x3 > x4)
	{
		c = x3;
		x3 = x4;
		x4 = c;
	}
	if (x1 > x3)
	{
		c = x1;
		x1 = x3;
		x3 = c;
	}
	if (x2 > x4)
	{
		c = x2;
		x2 = x4;
		x4 = c;
	}
	if (x2 > x3)
	{
		c = x2;
		x2 = x3;
		x3 = c;
	}

	cout << "Заданный порядок чисел: " << x1 << " < " << x2 << " < " << x3 << " < " << x4 << endl;

	cout << "\nРаботает второй способ!" << endl;

	x12 > x22 ? c = x12, x12 = x22, x22 = c : true;
	x32 > x42 ? c = x32, x32 = x42, x42 = c : true;
	x12 > x32 ? c = x12, x12 = x32, x32 = c : true;
	x22 > x42 ? c = x22, x22 = x42, x42 = c : true;
	x22 > x32 ? c = x22, x22 = x32, x32 = c : true;

	cout << "Заданный порядок чисел: " << x12 << " < " << x22 << " < " << x32 << " < " << x42 << endl;
	 
	return 0;
}